In [1]:
import pandas as pd
import numpy as np

규칙: 한열에는 같은종류의 값이 들어가야함

In [321]:
qq=pd.DataFrame([[1,2,3,4],[1,2,2,1],[1,2,3,4],[44,3,2,1]],columns=['a','b','c','d'])

In [327]:
qq

    a  b  c  d
0   1  2  3  4
1   1  2  2  1
2   1  2  3  4
3  44  3  2  1

In [328]:
qq.iloc[:2,1:3]

   b  c
0  2  3
1  2  2

In [3]:
pandas

NameError: name 'pandas' is not defined

In [4]:
pd.DataFrame

pandas.core.frame.DataFrame

In [7]:
from pandas import Series, DataFrame  #pd. 안붙여도됌

*Series

In [6]:
pd.Series([2,3,4])

0    2
1    3
2    4
dtype: int64

In [8]:
exam=Series([2,3,4,4])

In [10]:
exam  #색인, 자료유형이 같이 출력됌

0    2
1    3
2    4
3    4
dtype: int64

In [19]:
exam.index  #인덱스=시작값이0 끝값이4 증분이1 인 range형 index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [330]:
exam=Series([2,3,4,4],index=['lee','kim','cho','kang'])   #a,b,c,d를 인덱스로 지정

In [331]:
exam

lee     2
kim     3
cho     4
kang    4
dtype: int64

In [30]:
print(exam['lee']) #인덱스로 값추출
print(exam['lee':'cho'])  #슬라이싱으로 값추출

2
lee    2
kim    3
cho    4
dtype: int64

In [33]:
exam=Series([1,2,3,4,5,21,9,13,4,4]); index=['a','b','c','d','e','f','g','h','i','k']

exam  #색인, 자료유형이 같이 출력됌

exam.index  #인덱스=시작값이0 끝값이4 증분이1 인 range형 index


b_result=(exam>=4) & (exam<8)

In [36]:
exam[b_result]    #논리값으로 트루되는것만 추출

3    4
4    5
8    4
9    4
dtype: int64

In [40]:
print(exam[(exam>=4) & (exam<8)],'\n\n\n\n\n\n\n\n')



np.sqrt(exam[(exam>=4) & (exam<8)])

3    4
4    5
8    4
9    4
dtype: int64

3    2.000000
4    2.236068
8    2.000000
9    2.000000
dtype: float64

In [42]:
dict={'kim':25,'lee':45,'cho':13}

In [51]:
exam=Series(dict)  #사전은 바로 시리즈로 바꿀수있음 키=인덱스, 값=값

In [52]:
exam

kim    25
lee    45
cho    13
dtype: int64

In [56]:
exam=Series(dict,index=['lee','kang','cho','kim'])   #인덱스지정,kang=새로운 인덱스== NAN값

In [57]:
exam  #누락된값 or 결측값은 NaN 으로 표기

lee     45.0
kang     NaN
cho     13.0
kim     25.0
dtype: float64

In [58]:
pd.notnull(exam)  #결측이 아니냐

lee      True
kang    False
cho      True
kim      True
dtype: bool

In [70]:
exam1=Series(dict)
exam2=Series([56,75,85,96],index=['cho','kang','kim','lee'])
print(exam1,'\n\n\n',exam2,'\n\n\n\n',exam1+exam2)   #인덱스가같은거끼리 계산
Result=exam1+exam2
Result.name=' 성적'  # 색인 이름지정
Result.index.name='choi'  #인덱스 추가
Result

kim    25
lee    45
cho    13
dtype: int64


 cho     56
kang    75
kim     85
lee     96
dtype: int64



 cho      69.0
kang      NaN
kim     110.0
lee     141.0
dtype: float64

choi
cho      69.0
kang      NaN
kim     110.0
lee     141.0
Name:  성적, dtype: float64

SyntaxError: invalid syntax (<ipython-input-73-58747f883808>, line 1)

* DataFrame -같은열은 같은자료형 가져야함

In [75]:
data={'mid':[25,24,22,21],'gender':['m','f','f','m'],'fin':[34,24,67,66]}

In [83]:
exam_df1=DataFrame(data)

In [84]:
exam_df1

   mid gender  fin
0   25      m   34
1   24      f   24
2   22      f   67
3   21      m   66

In [86]:
exam_df=DataFrame(data,columns=['fin','gender','mid','att'])

In [87]:
exam_df

   fin gender  mid  att
0   34      m   25  NaN
1   24      f   24  NaN
2   67      f   22  NaN
3   66      m   21  NaN

In [90]:

exam_df=DataFrame(data,columns=['fin','gender','mid','att'],index=['a','b','c','d'])  #인덱스 지정

In [91]:
exam_df

   fin gender  mid  att
a   34      m   25  NaN
b   24      f   24  NaN
c   67      f   22  NaN
d   66      m   21  NaN

In [333]:
#arr=np.array([['m','f','f','m'],[25,56,35,34],[45,34,22,12]])
arr=np.array([[25,56,35,34],[45,34,22,12],[2,3,1,2]])
exam=DataFrame(arr.T,columns=['v1','v2','v3'],index=['a','b','c','d'])

In [105]:
exam

   v1  v2  v3
a  25  45   2
b  56  34   3
c  35  22   1
d  34  12   2

In [106]:
exam.values

array([[25, 45,  2],
       [56, 34,  3],
       [35, 22,  1],
       [34, 12,  2]])

In [117]:
exam.loc['b':'d'] #색인으로 행 인덱싱

   v1  v2  v3
b  56  34   3
c  35  22   1
d  34  12   2

In [114]:
exam.iloc[1]  #원래 인덱스번호로 접근

v1    56
v2    34
v3     3
Name: b, dtype: int32

In [112]:
exam['v1']   #열이름으로 접근가능

a    25
b    56
c    35
d    34
Name: v1, dtype: int32

In [334]:
exam.v1   #이런식으로 열 접근가능

a    25
b    56
c    35
d    34
Name: v1, dtype: int32

In [122]:
exam[['v3','v1']]

   v3  v1
a   2  25
b   3  56
c   1  35
d   2  34

In [336]:
exam.loc['b':'d']

   v1  v2  v3
b  56  34   3
c  35  22   1
d  34  12   2

* 데이터 결합

In [126]:
gender=Series(['m','f','m','m'],index=['d','a','c','b'])  #결합할 데이터
exam['gender']=gender

In [130]:
gender

d    m
a    f
c    m
b    m
dtype: object

In [129]:
exam.T  #전치`

         a   b   c   d
v1      25  56  35  34
v2      45  34  22  12
v3       2   3   1   2
gender   f   m   m   m

In [136]:
exam.iloc[[2,3]][['v1','gender']]    #exam.iloc[[행인덱스]][[열인덱스]]

   v1 gender
c  35      m
d  34      m

In [143]:
exam.loc[['a','b']].gender

a    f
b    m
Name: gender, dtype: object

In [145]:
(exam.loc[['a','b']].gender)

a    f
b    m
Name: gender, dtype: object

In [147]:
exam.reindex(['c','a','b','f','d']) #재색인

     v1    v2   v3 gender
c  35.0  22.0  1.0      m
a  25.0  45.0  2.0      f
b  56.0  34.0  3.0      m
f   NaN   NaN  NaN    NaN
d  34.0  12.0  2.0      m

In [160]:
ex=Series([3,5,2,101])
ex.reindex([2,0,3,1,99],fill_value=0) #fill_value= NaN자리에 디폴트로 뭘넣을것인가
ex.reindex([2,0,3,1,99],method='ffill')  #bfill/ffill  = NAN값을 (바뀌기전) 뒷값/앞값으로 채움

2       2
0       3
3     101
1       5
99    101
dtype: int64

In [164]:
exam  #여기서선 d다음이없으니까 e다음(bfill)은 NaN값

   v1  v2  v3 gender
a  25  45   2      f
b  56  34   3      m
c  35  22   1      m
d  34  12   2      m

In [165]:
exam.reindex(['c','a','b','e','d'],method='ffill')

   v1  v2  v3 gender
c  35  22   1      m
a  25  45   2      f
b  56  34   3      m
e  34  12   2      m
d  34  12   2      m

In [ ]:
exam_df=DataFrame(data,columns=['fin','gender','mid','att'],index=['a','b','c','d'])

In [168]:
exam.reindex(['c','a','b','f','e'],method='bfill')

     v1    v2   v3 gender
c  35.0  22.0  1.0      m
a  25.0  45.0  2.0      f
b  56.0  34.0  3.0      m
f   NaN   NaN  NaN    NaN
e   NaN   NaN  NaN    NaN

In [169]:
exam.reindex(columns=['att','v1','v2','v3'],method='bfill')

ValueError: index must be monotonic increasing or decreasing

In [178]:
df=exam.reindex(columns=['att','v2','v1','v3'],fill_value=999)
print(df)

   att  v2  v1  v3
a  999  45  25   2
b  999  34  56   3
c  999  22  35   1
d  999  12  34   2

In [179]:
df

   att  v2  v1  v3
a  999  45  25   2
b  999  34  56   3
c  999  22  35   1
d  999  12  34   2

In [174]:
df.drop('c')   #행삭제

   att  v2  v1  v3
a  999  45  25   2
b  999  34  56   3
d  999  12  34   2

In [182]:
df.drop(['c'],axis=0) #행삭제

   att  v2  v1  v3
a  999  45  25   2
b  999  34  56   3
d  999  12  34   2

In [184]:
df.drop(['v1'],axis=1) #열삭제

   att  v2  v3
a  999  45   2
b  999  34   3
c  999  22   1
d  999  12   2

In [186]:
df  #drop method는 원본에 영향을주지않는다.

   att  v2  v1  v3
a  999  45  25   2
b  999  34  56   3
c  999  22  35   1
d  999  12  34   2

In [187]:
ex

0      3
1      5
2      2
3    101
dtype: int64

In [192]:
print(ex,'\n\n\n\n',ex[[1,0,2]])  #1,0,2행 추출

0      3
1      5
2      2
3    101
dtype: int64



 1    5
0    3
2    2
dtype: int64

In [195]:
ex

0      3
1      5
2      2
3    101
dtype: int64

In [198]:
b_data=[True,False,False,True]    #트루인 인덱스만 추출
ex[b_data]

0      3
3    101
dtype: int64

In [200]:
b_data=(ex>5)

ex[b_data]

3    101
dtype: int64

In [204]:
ex[ex>3]=float('NaN')  #3넘는놈은 Nan으로 바꿈

In [202]:
ex

0    3.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [206]:
df

   att  v2  v1  v3
a  999  45  25   2
b  999  34  56   3
c  999  22  35   1
d  999  12  34   2

In [209]:
print(df[df['v3']==2])  #v3 가 2인놈들만 출력

   att  v2  v1  v3
a  999  45  25   2
d  999  12  34   2

TypeError: '(slice(None, None, None), slice(None, 1, None))' is an invalid key

In [225]:
x=np.random.rand(100)
gender=np.where(x>0.5,'M','F')
gender
height=np.random.normal(loc=175,scale=6,size=100)
weight=np.random.normal(loc=68,scale=3,size=100)

In [277]:
DF=DataFrame({'gender':gender,'height':height,'weight':weight})

In [233]:
DF

   gender              height              weight
0       M   186.2831395060151   62.60979969928122
1       M   175.0688614235608   66.32768366056382
2       M  182.80724998986054    70.7108410996454
3       M  177.83008035127614   69.46045422276245
4       F   171.4741545797991  63.496073313202515
5       F   171.5045926316171   67.23364555046324
6       M  177.78390715768754   66.55064415911559
7       M   175.9112570127823   68.71463820080562
8       F  168.87164952853516   68.30851015655158
9       F   167.8360554607668   64.53222572717233
10      M  179.56043494874584   69.89452540605771
11      M  187.68609840415382   69.78023689207375
12      M  176.08312318306739   66.21242681980684
13      F  181.05312231926368    66.9372266414801
14      F  167.71847614091683   73.89829289627838
15      F  181.58907353039106   64.26431519593207
16      F  183.05899036193375   64.96938964842792
17      F  181.58660397382286   71.57488979238681
18      M  176.50277189247288   66.28013674895071
19      F  170.37134878528798   67.88416151335464
20      F  192.50488572522588   64.30803166086704
21      M  165.84144162004253   65.16764529981259
22      F  175.48148679868763   69.06330770937151
23      F   188.1384496536677   68.94485490716613
24      M  176.85868299836707   68.73618395376606
25      F  167.56969126341878   67.66534370506996
26      F   174.4711096793862   68.54226618227374
27      F  179.71840488262643   69.07265805999855
28      M   172.4904061313749    69.6525315335599
29      M  165.79163171751003   64.83946247375718
..    ...                 ...                 ...
70      F  171.93816709626614  62.025996646578356
71      M  168.96284360164975   68.77106014544124
72      M   183.8923268190624   68.46810202436828
73      M   156.3138625540961   67.11420174143231
74      F  169.84030725771558   62.41614877965469
75      F  164.98105597776902   70.20144567531858
76      M  174.49752149120297   69.22255234966387
77      M   173.7397520278939   64.01038131519424
78      F    169.983600869522   65.34125996049639
79      F   175.4687195924772   66.32335606682354
80      M  174.93306683593948   70.82032753678541
81      M  178.04476985722349   66.21115619633895
82      M   181.8136806597737   68.29280117565229
83      F   174.6820398355456   67.57879554113933
84      F  170.48742205291268    68.2794066343946
85      F  172.76581686577774   69.96086720332235
86      F  172.17467810082212   66.60650242835699
87      F  177.59943713907776   68.65310223487919
88      F  170.29241521229767   67.00603553771923
89      F  176.81707405042192    69.5910489817784
90      M    183.837418663771   64.99417758240966
91      F   175.1722913839415   72.77088094997721
92      M   173.6924959770204   66.06484698327644
93      F  176.87440981044344   67.99889404713494
94      M  173.83957831094128   66.94956742603677
95      F  184.94368588313264   66.45892453570796
96      M  173.21931462605963   66.53447793868133
97      F  172.41386111976732   67.62839715954364
98      M  177.57757103353606    72.0244375938591
99      F  170.19670569106597   67.14324305975235

[100 rows x 3 columns]

In [242]:

np.random.seed(12298)
rand_num=np.random.rand(100)
rand_num
select=rand_num<0.9
np.sum(select)
select

array([False,  True,  True,  True,  True, False,  True, False,  True,
        True,  True,  True,  True,  True, False,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True, False,  True,  True,  True,  True,  True, False,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True, False,  True,  True,  True,  True,  True,  True,  True,
       False,  True,  True,  True,  True,  True,  True,  True, False,
        True,  True, False,  True,  True,  True,  True,  True, False,
        True,  True,  True,  True,  True,  True, False,  True,  True,
       False,  True,  True, False, False,  True,  True,  True,  True,
        True])

In [244]:
np.sum(select)  #85개를 훈련자료, 15개를 테스트자료로 쓴다

85

In [246]:
trian=DF[select]  #85개의 데이터가 뽑힘

   gender              height              weight
1       M   175.0688614235608   66.32768366056382
2       M  182.80724998986054    70.7108410996454
3       M  177.83008035127614   69.46045422276245
4       F   171.4741545797991  63.496073313202515
6       M  177.78390715768754   66.55064415911559
8       F  168.87164952853516   68.30851015655158
9       F   167.8360554607668   64.53222572717233
10      M  179.56043494874584   69.89452540605771
11      M  187.68609840415382   69.78023689207375
12      M  176.08312318306739   66.21242681980684
13      F  181.05312231926368    66.9372266414801
15      F  181.58907353039106   64.26431519593207
16      F  183.05899036193375   64.96938964842792
17      F  181.58660397382286   71.57488979238681
18      M  176.50277189247288   66.28013674895071
19      F  170.37134878528798   67.88416151335464
20      F  192.50488572522588   64.30803166086704
21      M  165.84144162004253   65.16764529981259
22      F  175.48148679868763   69.06330770937151
23      F   188.1384496536677   68.94485490716613
24      M  176.85868299836707   68.73618395376606
25      F  167.56969126341878   67.66534370506996
26      F   174.4711096793862   68.54226618227374
27      F  179.71840488262643   69.07265805999855
28      M   172.4904061313749    69.6525315335599
29      M  165.79163171751003   64.83946247375718
30      M  168.80843238156302   65.04359437368909
31      F   180.6250872093609   68.83617454383855
32      M  178.29416562736137   66.79934672592974
33      F  181.58030607260886   73.14448190366465
..    ...                 ...                 ...
62      F  173.61910846984014   69.73961393866078
64      M  168.04531650808187   72.92799039872374
65      F   173.2685761582005   67.11010280207196
66      M  185.02479609496865    67.5410093436497
67      M  180.14015940139097   71.24439655580622
68      F   175.5511612002564   68.15410519036135
69      F   173.7265387631845   69.39181255001112
70      F  171.93816709626614  62.025996646578356
72      M   183.8923268190624   68.46810202436828
73      M   156.3138625540961   67.11420174143231
75      F  164.98105597776902   70.20144567531858
76      M  174.49752149120297   69.22255234966387
77      M   173.7397520278939   64.01038131519424
78      F    169.983600869522   65.34125996049639
79      F   175.4687195924772   66.32335606682354
81      M  178.04476985722349   66.21115619633895
82      M   181.8136806597737   68.29280117565229
83      F   174.6820398355456   67.57879554113933
84      F  170.48742205291268    68.2794066343946
85      F  172.76581686577774   69.96086720332235
86      F  172.17467810082212   66.60650242835699
88      F  170.29241521229767   67.00603553771923
89      F  176.81707405042192    69.5910489817784
91      F   175.1722913839415   72.77088094997721
92      M   173.6924959770204   66.06484698327644
95      F  184.94368588313264   66.45892453570796
96      M  173.21931462605963   66.53447793868133
97      F  172.41386111976732   67.62839715954364
98      M  177.57757103353606    72.0244375938591
99      F  170.19670569106597   67.14324305975235

[85 rows x 3 columns]

In [251]:
test=DF[~select] #테스트용15개

In [252]:
len(test)

15

In [279]:
m_data=DF[DF['gender']=='M']

In [280]:
f_data=DF[DF['gender']=='F']

In [281]:
newdata=DF[(DF['gender']=='M') & (DF['height']>=180)]

In [282]:
newdata

   gender      height     weight
0       M  186.283140  62.609800
2       M  182.807250  70.710841
11      M  187.686098  69.780237
42      M  181.159928  64.467844
51      M  181.367199  67.154244
66      M  185.024796  67.541009
67      M  180.140159  71.244397
72      M  183.892327  68.468102
82      M  181.813681  68.292801
90      M  183.837419  64.994178

In [296]:
ex1=Series(np.random.binomial(n=100,p=0.6,size=6),index=['a','b','c','d','e','f'])
ex2=Series(np.random.binomial(n=50,p=0.4,size=7),index=['a','b','c','d','e','q','z'])
print(ex1,ex2,'\n\n\n<ex1+ex2>:\n\n',ex1+ex2)  


#인덱스맞는게 없으면 NAN으로 리턴

a    72
b    64
c    61
d    70
e    62
f    63
dtype: int32 a    18
b    16
c    20
d    19
e    21
q    24
z    19
dtype: int32


<ex1+ex2>:

 a    90.0
b    80.0
c    81.0
d    89.0
e    83.0
f     NaN
q     NaN
z     NaN
dtype: float64

In [304]:
print(ex1.add(ex2,fill_value=0))   #fill_value= NaN값을 0으로채우고 계산실행

a    90.0
b    80.0
c    81.0
d    89.0
e    83.0
f    63.0
q    24.0
z    19.0
dtype: float64

* 시리즈/데이터프레임 연산

In [309]:
ex1=Series([3,5,1],index=['att','hw','etc'])
ex2=Series([3,5,1],index=['st1','st4','st2'])
DF=DataFrame({'att':[5,7,8,6],'hw':[1,2,3,4],'mid':[0,9,2,4],'fin':[1,2,1,22]},index=['st1','st2','st3','st4'])
print(ex1,'\n\n\n\n', DF,'\n\n\n\n', DF+ex1)


#시리즈 인덱스에 해당하는값(att:3)을 데이터프레임 해당열(column=att)에 전부 더해준다

att    3
hw     5
etc    1
dtype: int64



      att  hw  mid  fin
st1    5   1    0    1
st2    7   2    9    2
st3    8   3    2    1
st4    6   4    4   22



       att  etc  fin   hw  mid
st1   8.0  NaN  NaN  6.0  NaN
st2  10.0  NaN  NaN  7.0  NaN
st3  11.0  NaN  NaN  8.0  NaN
st4   9.0  NaN  NaN  9.0  NaN

print(ex2,'\n\n\n\n', DF,'\n\n\n\n', DF.add(ex2,axis=0))  #시리즈 행에 해당하는 값을 데이터프레임 각행에 전부더해준다

In [319]:
print(np.minimum(ex1,ex2))  #인덱스가 다른경우 = 넘파이에선 입력순서로 인덱스를잡는다.(넘파이는 인덱스무시,순서만고려)

att    3
hw     5
etc    1
dtype: int64

In [416]:
ex1=Series([3,5,1],index=['att','hw','etc'])
ex2=Series([3,5,1],index=['st1','st4','st2'])
DF=DataFrame({'att':[5,7,8,np.nan],'hw':[np.nan,2,3,4],'mid':[0,9,2,4],'fin':[1,2,1,22]},index=['st1','st2','st3','st4'])
#print(ex1,'\n\n\n\n', DF,'\n\n\n\n', DF+ex1)

print(DF,'\n\n\n\n',DF.apply(np.sum,axis=0))# apply= map 같은거,,, 열별 합계
print('\n\n\n\n',DF.apply(np.sum,axis=1))  #행별 합계

     att   hw  mid  fin
st1  5.0  NaN    0    1
st2  7.0  2.0    9    2
st3  8.0  3.0    2    1
st4  NaN  4.0    4   22



 att    20.0
hw      9.0
mid    15.0
fin    26.0
dtype: float64




 st1     6.0
st2    20.0
st3    14.0
st4    30.0
dtype: float64

     att  hw  mid  fin
st1    5   1    0    1
st2    7   2    9    2
st3    8   3    2    1
st4    6   4    4   22

In [361]:
def f(x):
    return Series([x.min(),x.max(),x.mean()],index=['최소','최대','평균'])
print(DF.apply(f))  #열별계산

def g(x):
    fa=1
    for i in range(1,(x+1)):
        fa*=i
    return fa

    att   hw   mid   fin
최소  5.0  1.0  0.00   1.0
최대  8.0  4.0  9.00  22.0
평균  6.5  2.5  3.75   6.5

In [360]:
DataFrame(DF.apply(f))

    att  hw  mid  fin
최소    5   1    0    1
최대    8   4    9   22
범위    3   3    9   21

In [365]:
print(DF.applymap(np.exp))  #원소별 연산
print(np.exp(DF))  #같은결과

             att         hw          mid           fin
st1   148.413159   2.718282     1.000000  2.718282e+00
st2  1096.633158   7.389056  8103.083928  7.389056e+00
st3  2980.957987  20.085537     7.389056  2.718282e+00
st4   403.428793  54.598150    54.598150  3.584913e+09
             att         hw          mid           fin
st1   148.413159   2.718282     1.000000  2.718282e+00
st2  1096.633158   7.389056  8103.083928  7.389056e+00
st3  2980.957987  20.085537     7.389056  2.718282e+00
st4   403.428793  54.598150    54.598150  3.584913e+09

In [391]:
ex1=Series([3,5,1,np.inf,3.1,np.nan,6,2],index=['a5','a6','a3','a4','a1','a2','a7','a8'])
ex2=Series([3,5,1],index=['st1','st4','st2'])
DF=DataFrame({'att':[5,7,8,67],'hw':[1,2,3,67],'mid':[0,9,2,4],'fin':[1,2,1,22]},index=['st1','st2','st3','st4'])

In [377]:
print(ex1,'\n\n\n\n',ex1.sort_index(ascending=False),'\n\n\n',DF)  #내림차순 인덱스로 분류

a5    3.0
a6    5.0
a3    1.0
a4    inf
a1    3.1
a2    NaN
a7    6.0
a8    2.0
dtype: float64



 a8    2.0
a7    6.0
a6    5.0
a5    3.0
a4    inf
a3    1.0
a2    NaN
a1    3.1
dtype: float64


      att  hw  mid  fin
st1    5   1    0    1
st2    7   2    9    2
st3    8   3    2    1
st4    6   4    4   22

In [379]:
print(ex1.sort_values())  #값으로 분류 , NAN은 ascending이든 descending이든 무조건 마지막에깔림

a3    1.0
a8    2.0
a5    3.0
a1    3.1
a6    5.0
a7    6.0
a4    inf
a2    NaN
dtype: float64

In [385]:
DF.sort_index(ascending=False)  #데이터프레임 인덱스로 정렬

     att  hw  mid  fin
st4    6   4    4   22
st3    8   3    2    1
st2    7   2    9    2
st1    5   1    0    1

In [387]:
DF.sort_index(axis=1,ascending=False)  #열중에서 m이 가장커서 왼쪽 a가제일작아서 오른쪽ㄱ

     mid  hw  fin  att
st1    0   1    1    5
st2    9   2    2    7
st3    2   3    1    8
st4    4   4   22    6

In [389]:
DF.sort_values(axis=1,by='st1')  #by=어떤열의 값을 기준으로 정렬할건지

     mid  hw  fin  att
st1    0   1    1    5
st2    9   2    2    7
st3    2   3    1    8
st4    4   4   22    6

In [390]:
DF.sort_values(axis=0,by='fin')  #by=어떤열의 값을 기준으로 정렬할건지

     att  hw  mid  fin
st1    5   1    0    1
st3    8   3    2    1
st2    7   2    9    2
st4    6   4    4   22

In [395]:
DF.sort_values(axis=1,by=['st4','st1'])  #by=어떤열의 값을 기준으로 정렬할건지, 두개잡는경우=동률인경우

     mid  fin  hw  att
st1    0    1   1    5
st2    9    2   2    7
st3    2    1   3    8
st4    4   22  67   67

In [400]:
ex1.rank(method='first')  #first=들어간순서

a5    3.0
a6    5.0
a3    1.0
a4    7.0
a1    4.0
a2    NaN
a7    6.0
a8    2.0
dtype: float64

강제사항은아니지만 인덱스는 중복안되는게 좋다.

In [403]:
print(ex1.index.is_unique,DF.index.is_unique)  #인덱스 중복이 없는가?

True True

In [406]:
ex1

a5    3.0
a6    5.0
a3    1.0
a4    inf
a1    3.1
a2    NaN
a7    6.0
a8    2.0
dtype: float64

In [407]:
ex1.mean(skipna=False)

nan

In [409]:
DF

     att  hw  mid  fin
st1    5   1    0    1
st2    7   2    9    2
st3    8   3    2    1
st4   67  67    4   22

In [408]:
DF.mean

<bound method DataFrame.mean of      att  hw  mid  fin
st1    5   1    0    1
st2    7   2    9    2
st3    8   3    2    1
st4   67  67    4   22>

In [414]:
DF.cumsum()  #누적합

      att    hw   mid   fin
st1   5.0   1.0   0.0   1.0
st2  12.0   3.0   9.0   3.0
st3  20.0   6.0  11.0   4.0
st4   NaN  10.0  15.0  26.0

In [418]:
DF.cumsum(skipna=False)  #NaN나온이후로는 전부 NAN으로 처리

      att  hw   mid   fin
st1   5.0 NaN   0.0   1.0
st2  12.0 NaN   9.0   3.0
st3  20.0 NaN  11.0   4.0
st4   NaN NaN  15.0  26.0

* 백분위수

In [419]:
DF.quantile(q=[0.15,0.95])   #4분위수, [퍼센트값,퍼센트값]

      att   hw   mid   fin
0.15  5.6  2.3  0.90   1.0
0.95  7.9  3.9  8.25  19.0

차분위=자기값-자기이전값

In [420]:
DF.describe()

            att   hw      mid       fin
count  3.000000  3.0  4.00000   4.00000
mean   6.666667  3.0  3.75000   6.50000
std    1.527525  1.0  3.86221  10.34408
min    5.000000  2.0  0.00000   1.00000
25%    6.000000  2.5  1.50000   1.00000
50%    7.000000  3.0  3.00000   1.50000
75%    7.500000  3.5  5.25000   7.00000
max    8.000000  4.0  9.00000  22.00000